Revit 2027 API
RevolutionFailures Properties
The BuiltInFailures.RevolutionFailures type exposes the following members.
Properties
Name | Description
CannotDrawRevolution |  Can't create surface of revolution.
ProfileCrossesRevolutionAxis |  The profile must not cross the axis of revolution.
ProfileNotPlanar |  The Profile must lie in a plane.
Top
See Also
Reference
BuiltInFailures.RevolutionFailures Class
Autodesk.Revit.DB Namespace